{
  "backend/main.mo": "Motoko actor defining the backend for a study app, managing users, syllabus progress, Pomodoro sessions, and study streaks with persistent storage and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (app shell, dark/light mode, login, clock, etc.) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON map of frontend component file paths to short descriptions covering TestReminders, SyllabusTracker, ExamCountdown, AchievementBadges, AIDoubtSolver, and CrashCourseMode components.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app titled 'Aim 100/100 Boards 2026–27' that mounts the root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that initializes theme, authentication, and study streak hooks, applies the dark/light class to the document, and conditionally renders LoginScreen or MainLayout.",
  "frontend/src/components/AchievementBadges.tsx": "Achievement badges component displaying syllabus-completion badges (Legend/Pro/GOAT) and streak badges, playing a fanfare sound when a new badge threshold is crossed.",
  "frontend/src/components/AIDoubtSolver.tsx": "Chat-style AI doubt solver component with suggested NCERT questions, markdown-formatted responses, typing indicator, and a scrollable message history with clear functionality.",
  "frontend/src/components/ClockSection.tsx": "Renders a tabbed clock section with a live analog/digital clock, an alarm manager (add/remove/toggle alarms), and a stopwatch with lap tracking, using custom hooks for alarms, stopwatch, and sound effects.",
  "frontend/src/components/CrashCourseMode.tsx": "Displays a 90-day crash course plan as a week-by-week accordion with per-task checkboxes, progress bars, and subject-color-coded badges, persisting completion state via the useCrashCourse hook.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard showing a hero banner, study streak, syllabus completion, exam countdown, upcoming test alerts, and quick-navigation cards linking to all major app sections.",
  "frontend/src/components/ExamCountdown.tsx": "Shows a live countdown (days/hours/minutes/seconds) to a user-configurable board exam date, with milestone cards and tips displayed based on days remaining.",
  "frontend/src/components/ImageGallery.tsx": "Provides a paginated 500-slot image gallery (stored in localStorage) with upload, delete, and lightbox preview functionality, organized into named banks via tabs.",
  "frontend/src/components/LoginScreen.tsx": "Renders a login/signup screen with username and password fields, supporting both first-time password setup and returning user authentication via an injected auth hook.",
  "frontend/src/components/MainLayout.tsx": "Provides the main app shell with a sidebar navigation, theme toggle, and logout button, rendering one of twelve feature sections (Dashboard, Pomodoro, Syllabus, AI Doubt, etc.) based on active selection.",
  "frontend/src/components/MusicPlayer.tsx": "Displays a music player UI with two tabs—motivational songs and binaural beats—allowing track selection, play/pause/skip controls, and volume adjustment, with YouTube search links for each track.",
  "frontend/src/components/NotificationsFeed.tsx": "Shows a feed of study-platform notifications with support for adding new updates (title, description, optional link), marking items read, and deleting them via the useNotifications hook.",
  "frontend/src/components/PomodoroTimer.tsx": "Implements a Pomodoro study timer with a circular SVG progress ring, configurable focus/break/long-break durations, and session counting, using the usePomodoro and useSoundEffects hooks.",
  "frontend/src/components/SyllabusTracker.tsx": "React component that displays NCERT syllabus progress per subject with collapsible chapter checklists, progress bars, and milestone badges, using sound effects on chapter completion.",
  "frontend/src/components/TestReminders.tsx": "React component for scheduling and displaying upcoming test reminders with urgency color-coding, due-soon alerts, and a form to add/delete reminders by subject and date.",
  "frontend/src/data/crashCoursePlan.ts": "Defines TypeScript interfaces and exports a structured multi-week crash course study plan with daily tasks organized by subject for Class 12 board exam preparation.",
  "frontend/src/data/faqDatabase.ts": "Contains a static FAQ database of keyword-tagged question-answer pairs covering Class 12 NCERT topics across Physics, Chemistry, and other subjects for use by the AI doubt solver.",
  "frontend/src/data/ncertData.ts": "Defines the NCERTSubject interface and exports a list of Class 11 and 12 subjects (Physics, Chemistry, Maths, Biology, English, etc.) with their chapter names, icons, and color themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAIDoubtSolver.ts": "Custom React hook that manages a chat message state with localStorage persistence, performs keyword-based FAQ matching to answer user questions, and simulates AI typing delay.",
  "frontend/src/hooks/useAlarms.ts": "Manages a list of alarms persisted in localStorage, providing add/remove/toggle operations and a 1-second interval that triggers a callback when an enabled alarm's time matches the current time.",
  "frontend/src/hooks/useAuth.ts": "Handles local username/password authentication with SHA-256 hashing, storing credentials and session state in localStorage, and exposing login, setup, logout, and error-clearing functions.",
  "frontend/src/hooks/useCountdown.ts": "Calculates and updates a live countdown to a configurable exam date (persisted in localStorage), returning days/hours/minutes/seconds values and a contextual milestone message.",
  "frontend/src/hooks/useCrashCourse.ts": "Tracks task completion state for a crash course plan stored in localStorage, providing toggle, completion check, and overall/per-week progress percentage calculations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and React provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status flags.",
  "frontend/src/hooks/useNotifications.ts": "Manages a list of notifications persisted in localStorage with operations to add, mark as read, mark all as read, and delete notifications, along with an unread count.",
  "frontend/src/hooks/usePomodoro.ts": "Implements a Pomodoro timer using requestAnimationFrame for accurate countdown, supporting focus/break/longBreak modes with configurable durations, session counting, and start/pause/reset/skip controls.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating backend data (syllabus progress, Pomodoro sessions, study streaks) via the ICP actor, with cache invalidation on mutations.",
  "frontend/src/hooks/useSoundEffects.ts": "Provides a React hook that exposes playClick, playSuccess, playAlarm, and playFanfare functions using the Web Audio API to generate beeps and chimes, with a toggleSounds toggle.",
  "frontend/src/hooks/useStopwatch.ts": "Implements a stopwatch hook with start, pause, reset, and lap functionality using requestAnimationFrame for accurate elapsed-time tracking and a formatTime helper.",
  "frontend/src/hooks/useStudyStreak.ts": "Tracks daily study streaks (current, longest, total days) persisted in localStorage, with recordActivity to increment the streak and checkStreak to reset it if a day was missed.",
  "frontend/src/hooks/useSyllabusProgress.ts": "Manages per-chapter completion state for NCERT subjects stored in localStorage, providing toggleChapter, per-subject completion percentage, and overall completion percentage helpers.",
  "frontend/src/hooks/useTestReminders.ts": "Manages test reminder entries (subject, date, notes) persisted in localStorage with CRUD operations and a getTestsDueSoon filter for reminders within the next three days.",
  "frontend/src/hooks/useTheme.ts": "Provides a light/dark theme toggle that persists the selection to localStorage and applies or removes the 'dark' class on the document root.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind base/components/utilities, and defines OKLCH-based CSS custom properties for light and dark color themes along with reusable component classes like premium-card and gold-gradient.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH color tokens, typography/font families, border radii, box shadows, and keyframe animations, plus the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 3) for the 'Aim 100/100 Boards 2026–27' EdTech platform, listing all existing features, architectural notes, image requirements, and known issues."
}